app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("code", "created_at", "name", "price", "shop_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["code", "Bae"], ["created_at", "2015-01-28 00:44:03.079456"], ["name", "Baedalus"], ["price", "5600.0"], ["shop_id", 1], ["updated_at", "2015-01-28 00:44:03.079456"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "code" = ?, "name" = ?, "price" = ?, "updated_at" = ? WHERE "items"."id" = 5  [["code", "RoR"], ["name", "Ring of Regeneration"], ["price", 350.0], ["updated_at", "2015-01-16 07:44:16.370394"]]