app/controllers/shopping_lists_controller.rb

SELECT "shopping_lists".* FROM "shopping_lists"
---
  def index
    @shopping_lists = ShoppingList.all

INSERT INTO "shopping_lists" ("created_at", "deadline", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-12 05:02:02.289183"], ["deadline", "2015-01-12"], ["name", "My Expenses for Today"], ["updated_at", "2015-01-12 05:02:02.289183"]]
---
  def create
    @shopping_list = ShoppingList.new(shopping_list_params)

    respond_to do |format|
      if @shopping_list.save

UPDATE "shopping_lists" SET "total_price" = ?, "updated_at" = ? WHERE "shopping_lists"."id" = 1  [["total_price", 2100.0], ["updated_at", "2015-01-12 05:03:06.191616"]]
---
  def update
    respond_to do |format|
      if @shopping_list.update(shopping_list_params)

DELETE FROM "shopping_lists" WHERE "shopping_lists"."id" = ?  [["id", 1]]
---
  def destroy
    @shopping_list.destroy

SELECT  "shopping_lists".* FROM "shopping_lists"  WHERE "shopping_lists"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_shopping_list
      @shopping_list = ShoppingList.find(params[:id])