app/controllers/shopping_list_items_controller.rb

  def index
    @shopping_list_items = ShoppingListItem.all
---
SELECT "shopping_list_items".* FROM "shopping_list_items"

  def destroy
    @shopping_list_item.destroy
---
DELETE FROM "shopping_list_items" WHERE "shopping_list_items"."id" = ?  [["id", 1]]

    def set_shopping_list_item
      @shopping_list_item = ShoppingListItem.find(params[:id])
---
SELECT  "shopping_list_items".* FROM "shopping_list_items"  WHERE "shopping_list_items"."id" = ? LIMIT 1  [["id", 1]]